
'''
签到系统配置文件
'''

# 每日运势最小值
LUCKY_MIN = 1

# 每日运势最大值
LUCKY_MAX = 100

# 每次签到获得的好感度
FRIENDLY_ADD = 1

# 每次签到金币底薪
GOLD_BASE = 10

# 幸运值影响金币因子
LUCKY_GOLD = 1

# 签到随机语录
RANDOM_SAID = [
    '在好几个瞬间，都觉得自己很落单。',
    '我好花心，你每天的样子我都好喜欢。',
    '有些异性不能拿来做恋人，却也舍不得给别人。',
    '麻烦自己活的酷一点，对自己好一点。',
    '一路走来，我用我的善良，喂了不少没有良心的狗！',
    '孤独不可怕，怕的是你拒绝所有陪伴。',
    '是否紧闭上眼，才会无视你的存在。',
    '一辈子不长，对心好点，别让她受伤。',
    '有您在身边，我觉得平凡都很富有色彩。',
    '对不起，不够能力做你的保姆。',
    '世界这么乱 装纯给谁看﹋',
    '做人要先学会听话，然后再学会讲话。',
    '想想 、还是幼儿园好混。',
    '笑只是一个表情，与快乐无关。',
    'QQ的在线率越高 ，证明这个人越寂寞。',
    '累么。累就对了，舒服是留给死人的。',
    '距离产生的不是美，是小三',
    '你的话 我连标点符号都不信',
    '当幸福来敲门的时候 、我或许不在家',
    '花花世界，是我太过认真',
    '女人，长得漂亮是优势，活得漂亮是本事',
    '早该没心没肺， 不用现在的撕心裂肺。',
    '男人的实力，就是你兜里的人民币',
    '我没有那么多的感慨，仅仅想有个人陪。',
    '在好几个瞬间，都觉得自己很落单。',
    '我好花心，你每天的样子我都好喜欢。',
    '麻烦自己活的酷一点，对自己好一点。',
    '我就这么一颗心，你省着点玩，悠着点伤',
    '往事是否就此将就，你我是否就此别过',
    '亲爱的自己，并不完美，却是我喜欢和爱的模样',
    '爱你是天赋，得不到你大概是天赋异禀遭嫉妒',
    '时间不知不觉，我们后知后觉',
    '背道而驰，越走越远，再也回不到从前',
    '我还是很喜欢你，就像那远方和诗，可望不可及',
]


# 凌晨随机语录scheduler
RANDOM_SAID_SCHEDULER = [
    '今天又是元气满满的一天呢~',
    '把坚持打包在岁月中，你会感到，生活是甜的，把努力书写到行为中，你会感到人生是美的。',
    '从没有人，过着风平浪静的生活，就能到达梦想的彼岸，时光永远静好，生活从来不易，不过没关系，明天的太阳会把你照亮，所以你也是会发光的。',
    '再微弱的光，也能照亮一方;再小的火苗，也能温暖怀抱。新的一天或许平平淡淡，但请相信，即使平凡，我们也能在生活中闪光。',
    '人生不是攀岩的过程，而是从种子长成大树的过程，这个过程必须经历风吹雨打和不知道的考验，而只有这样成长成的大树才无坚不催 。',
    '一眼就能看得到头，不是我们想要的生活，我们为之努力，是努力让自己的生活多一种可能。',
    '没有一件事是可以轻而易举完成的，也没有随随便便的成功，如果成功都可以变得简单，那么还有意义吗?如果你选择了一条路，一定要记得走到终点 。',
    '世上唯一不能复制的是时间，唯一不能重演的是人生。该怎么走，过什么样的生活，全凭自己的选择和努力 ，人生很贵，不可浪费 。',
    '因为还有很多的明天，很多的梦想，所以今天需要更加努力，加油吧，有梦的人，以足够努力的现在，换取心之向往的未来。',
    '真正想做成一件事，不取决于你有多少热情，而是看你能坚持多久。千万别奢望光有热情就能得偿所愿。',
    '如果你想要某样东西，别等着有人某天会送给你。生命太短，等-不-得。',
]
